import React from 'react';
import './InfoPage.css';

const InfoPage = () => {
    return (
        <div className={"info-page-container"}>
            <h1>ТОҒЫЗҚҰМАЛАҚ ЕРЕЖЕСІ</h1>
            <p>Тоғызқұмалақ ойыны арнайы тақтада екі адам арасында ойналады. Ойын тақтасы – 2 қазан, 18 отау, 162 құмалақтан тұрады.
                Ойын басында әр ойыншыға бір қазан, тоғыз отауға тоғыз-тоғыздан салынған сексен бір құмалақ тиесілі.</p>
            <p>Алғашқы жүріс жасаған ойыншыны – бастаушы, қарымта жүріс жасаған ойыншыны – қостаушы деп атайды.
                Кейде бастаушы үшін – ақ жағы, қостаушы үшін қара жағы деген тіркестерді де қолданамыз.</p>
            <p>Тақтаның жалпы құрылысы төмендегідей:</p>
            <img src={"http://9kumalak.com/images/ereje/ereje_1.jpg"}/>
            <p>Бұл жерде - №1 №2 №3 №4 №5 №6 №7 №8 №9 - отаулар</p>
            <p>Берілген диаграммада  бастаушының отаулары төменгіжағында,  ал қазандағы құмалақтар  саны жоғарғыжағында орналасқан.</p>
            <p>Жүріс жасау ерекшеліктері</p>
            <p>Жүріс ойыншылар тарапынан кезектесіп жүріледі. Жүрісті кімнің жасайтыны жеребемен немесеқарсыластардың  келісімімен анықталады.</p>
            <ol>
                <li>
                    <p>Жүріс жасау үшін өз жағыңыздағы отаулардың бірінен біреуін орнына қалдырып, қалған құмалақтарды
                    қолға алып, солдан оңға қарай бір-бірлеп таратамыз. Тарату сәтінде құмалақтар өз отауларымыздан
                    асып кететін болса, қарсыластың отауына таратамыз. Егер соңғы құмалақ қарсыластың тақ санды құмалағы
                    бар отауына түсіп, ондағы құмалақтарды жұп қылса (2, 4, 6, 10, 12), сол отаудағы құмалақтар ұтып алынып,
                    өз қазанымызға салынады.</p>
                    <p>Егер соңғы құмалақ қарсыластың жұп санды құмалағы бар отауына түсіп (3 құмалақтан басқа), тақ
                        қылса немесе өз отауымызға түссе, құмалақ ұтып алынбайды.</p>
                    <p>Мәселен, жоғарыдағы тақтадағы алғашқы жағдайда бастаушы №7 отаудағы 9 құмалағын таратса, соңғысы
                        қарсыласының №6 отауына барып түседі және ондағы 9 құмалақ соңғы құмалақпен 10 болып,
                        ұтып алынады және қазанға салынады.</p>
                    <p>Сол кезде тақтада төмендегідей жағдай қалыптасады.</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_2.jpg"}/>

                </li>
                <li>
                    <p>Отаудағы жалғыз құмалақ көрші отауға жүргенде орны бос қалады.</p>
                </li>
                <li>
                    <p>Жүріс жасаған кезде отауларға құмалақ салмай немесе 2-3 құмалақ бөліп алып жүруге болмайды.</p>
                    <p>Тұздық алу ережесі</p>
                    <p>Тоғызқұмалақ ойынында құмалақтан басқа ойында бір рет қарсыластың отауын ұтып алуға да болады.
                        Оны ежелде – “тұзды үй”, қазіргі тілде – тұздық деп атайды.</p>
                </li>
                <li>
                    <p>Тұздық алу үшін жүріс жасаған кезде, қарсыластың екі құмалағы бар отауына таратқан құмалағыңыздың соңғысын түсіру керек.</p>
                    <p>Сонда сол отауда қалыптасқан 3 құмалақпен бірге отау да ұтып алынып, ойынның аяғына дейін сіздің меншігіңізге айналады</p>
                    <p>Енді жүріс жасалған сайын тұздық алынған отауға түсетін бір құмалақ, міндетті түрде сіздің қазаныңызға салынып отырады.</p>
                    <p>Тұздық алынған отауға арнайы белгі қойылады. Жазбаша түрде – Х деген шартты таңбамен белгіленеді. Мәселен, төмендегі диаграммаға қарайық.</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_3.jpg"}/>
                    <p>Осы жағдайда қостаушы ойыншы №7 отаудағы 10 құмалағын тарату арқылы, соңғы құмалағын бастаушының
                        №7 отауына түсіріп, ондағы 2 құмалақты үшеу етіп,
                        осы құмалақтарды ұтумен қатар, осы отауға тұздық жариялайды. Сонда төмендегі жағдай қалыптасады.</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_4.jpg"}/>
                    <p>Ендігі кезде бүкіл ойын барысында №7 отау – қостаушының меншігіне айналады.</p>
                </li>
                <li>
                    <p>Тұздық ойында бір рет алынады және №9 отаудан ешқашан алынбайды.</p>
                </li>
                <li>
                    <p>Тұздық аттас отаулардан алынбайды.</p>
                    <p>Мысалы, жоғарыдағы диаграммадағы жағдайда қостаушы ойыншы №7 отаудан тұздық алды, енді бастаушы
                        ойыншы ойын барысында бұл отаудан тұздық алуға қақысы жоқ.</p>
                    <p>“Атсырау” ережесі</p>
                    <p>Ойын аяқталуға жақындаған сайын әр ойыншының отауларындағы құмалақ таусыла бастайды. Әр құмалақ
                        ұтып алынған сайын немесе тұздыққа түскен сайын қарсыластардың жүріс мөлшері кеми береді.
                        Сондықтан ойын соңында қарсыластардың бірінің отауларында жүріс жасай алмайтын жағдай да кездеседі.</p>
                </li>
                <li>
                    <p>Ойыншылардың бірінің отауларындағы құмалақты бірінші таусып алып, жүріссіз қалуы – атсырау деп аталады.</p>
                </li>
                <li>
                    <p>Атсырауға ұшыраған ойыншының қарсыласы бұл жағдайда қосымша бір жүріс жасап, барлық құмалақтарды өз қазанына салып алады. Мысалы:</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_5.jpg"}/>
                    <p>Осы тақтадағы жағдайда жүріс қостаушыдан. Ол №9 отаудағы 3 құмалағын таратады.</p>
                    <p>Өз кезегінде бастаушы №1 отауға түскен 1 құмалақты жүреді. Қостаушы №9 отаудағы жалғыз құмалақты 1 отауға салады.</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_6.jpg"}/>
                    <p>Бастаушы кез келген отаудағы құмалақпен, мәселен, 6 отаудағы 2 құмалақтың бірін орнына қалдырып
                        екіншісін 7 отауға көшіреді. Сонда төмендегіше жағдай туындайды:</p>
                    <img src={"http://9kumalak.com/images/ereje/ereje_7.jpg"}/>
                    <p>Осы жағдайда бастаушы отауларындағы барлық құмалақтарды (23құмалақты) қазанына салып, ойынның есебін жүргізеді.</p>
                </li>
                <li>
                    <p>Егер “атсырау” жағдайында қосымша жүріс жүрілген кезде, құмалақтар амалсыздан қарсыластың
                        отауларының біріне түсіп, жүріс беретін болса, ойын әрі қарай жалғаса береді.</p>
                </li>
                <p>Егер ойыншы ойын барысында 82 құмалақ жинаса ойын бірден тоқтатылады.</p>
            </ol>
        </div>
    );
};

export default InfoPage;